garyPenhook/PIC-Assembler/device_includes/pic16f13276.inc
// Register: CLBCLK
#define CLBCLK CLBCLK
CLBCLK                                   equ 0515h
// bitfield definitions
CLBCLK_CLK_POSN                          equ 0000h
CLBCLK_CLK_POSITION                      equ 0000h
CLBCLK_CLK_SIZE                          equ 0008h
CLBCLK_CLK_LENGTH                        equ 0008h
CLBCLK_CLK_MASK                          equ 00FFh
CLBCLK_CLK0_POSN                         equ 0000h
CLBCLK_CLK0_POSITION                     equ 0000h
CLBCLK_CLK0_SIZE                         equ 0001h
CLBCLK_CLK0_LENGTH                       equ 0001h
CLBCLK_CLK0_MASK                         equ 0001h
CLBCLK_CLK1_POSN                         equ 0001h
CLBCLK_CLK1_POSITION                     equ 0001h
CLBCLK_CLK1_SIZE                         equ 0001h
CLBCLK_CLK1_LENGTH                       equ 0001h
CLBCLK_CLK1_MASK                         equ 0002h
CLBCLK_CLK2_POSN                         equ 0002h
CLBCLK_CLK2_POSITION                     equ 0002h
CLBCLK_CLK2_SIZE                         equ 0001h
CLBCLK_CLK2_LENGTH                       equ 0001h
CLBCLK_CLK2_MASK                         equ 0004h
CLBCLK_CLK3_POSN                         equ 0003h
CLBCLK_CLK3_POSITION                     equ 0003h
CLBCLK_CLK3_SIZE                         equ 0001h
CLBCLK_CLK3_LENGTH                       equ 0001h
CLBCLK_CLK3_MASK                         equ 0008h
CLBCLK_CLK4_POSN                         equ 0004h
CLBCLK_CLK4_POSITION                     equ 0004h
CLBCLK_CLK4_SIZE                         equ 0001h
CLBCLK_CLK4_LENGTH                       equ 0001h
CLBCLK_CLK4_MASK                         equ 0010h
CLBCLK_CLK5_POSN                         equ 0005h
CLBCLK_CLK5_POSITION                     equ 0005h
CLBCLK_CLK5_SIZE                         equ 0001h
CLBCLK_CLK5_LENGTH                       equ 0001h
CLBCLK_CLK5_MASK                         equ 0020h
CLBCLK_CLK6_POSN                         equ 0006h
CLBCLK_CLK6_POSITION                     equ 0006h
CLBCLK_CLK6_SIZE                         equ 0001h
CLBCLK_CLK6_LENGTH                       equ 0001h
CLBCLK_CLK6_MASK                         equ 0040h
CLBCLK_CLK7_POSN                         equ 0007h
CLBCLK_CLK7_POSITION                     equ 0007h
CLBCLK_CLK7_SIZE                         equ 0001h
CLBCLK_CLK7_LENGTH                       equ 0001h
CLBCLK_CLK7_MASK                         equ 0080h

// Register: CLBSWOUTH
#define CLBSWOUTH CLBSWOUTH
CLBSWOUTH                                equ 0516h
// bitfield definitions
CLBSWOUTH_CLBSWOUTH_POSN                 equ 0000h
CLBSWOUTH_CLBSWOUTH_POSITION             equ 0000h
CLBSWOUTH_CLBSWOUTH_SIZE                 equ 0008h
CLBSWOUTH_CLBSWOUTH_LENGTH               equ 0008h
CLBSWOUTH_CLBSWOUTH_MASK                 equ 00FFh
CLBSWOUTH_CLBSWOUT8_POSN                 equ 0000h
CLBSWOUTH_CLBSWOUT8_POSITION             equ 0000h
CLBSWOUTH_CLBSWOUT8_SIZE                 equ 0001h
CLBSWOUTH_CLBSWOUT8_LENGTH               equ 0001h
CLBSWOUTH_CLBSWOUT8_MASK                 equ 0001h
CLBSWOUTH_CLBSWOUT9_POSN                 equ 0001h
CLBSWOUTH_CLBSWOUT9_POSITION             equ 0001h
CLBSWOUTH_CLBSWOUT9_SIZE                 equ 0001h
CLBSWOUTH_CLBSWOUT9_LENGTH               equ 0001h
CLBSWOUTH_CLBSWOUT9_MASK                 equ 0002h
CLBSWOUTH_CLBSWOUT10_POSN                equ 0002h
CLBSWOUTH_CLBSWOUT10_POSITION            equ 0002h
CLBSWOUTH_CLBSWOUT10_SIZE                equ 0001h
CLBSWOUTH_CLBSWOUT10_LENGTH              equ 0001h
CLBSWOUTH_CLBSWOUT10_MASK                equ 0004h
CLBSWOUTH_CLBSWOUT11_POSN                equ 0003h
CLBSWOUTH_CLBSWOUT11_POSITION            equ 0003h
CLBSWOUTH_CLBSWOUT11_SIZE                equ 0001h
CLBSWOUTH_CLBSWOUT11_LENGTH              equ 0001h
CLBSWOUTH_CLBSWOUT11_MASK                equ 0008h
CLBSWOUTH_CLBSWOUT12_POSN                equ 0004h
CLBSWOUTH_CLBSWOUT12_POSITION            equ 0004h
CLBSWOUTH_CLBSWOUT12_SIZE                equ 0001h
CLBSWOUTH_CLBSWOUT12_LENGTH              equ 0001h
CLBSWOUTH_CLBSWOUT12_MASK                equ 0010h
CLBSWOUTH_CLBSWOUT13_POSN                equ 0005h
CLBSWOUTH_CLBSWOUT13_POSITION            equ 0005h
CLBSWOUTH_CLBSWOUT13_SIZE                equ 0001h
CLBSWOUTH_CLBSWOUT13_LENGTH              equ 0001h
CLBSWOUTH_CLBSWOUT13_MASK                equ 0020h
CLBSWOUTH_CLBSWOUT14_POSN                equ 0006h
CLBSWOUTH_CLBSWOUT14_POSITION            equ 0006h
CLBSWOUTH_CLBSWOUT14_SIZE                equ 0001h
CLBSWOUTH_CLBSWOUT14_LENGTH              equ 0001h
CLBSWOUTH_CLBSWOUT14_MASK                equ 0040h
CLBSWOUTH_CLBSWOUT15_POSN                equ 0007h
CLBSWOUTH_CLBSWOUT15_POSITION            equ 0007h
CLBSWOUTH_CLBSWOUT15_SIZE                equ 0001h
CLBSWOUTH_CLBSWOUT15_LENGTH              equ 0001h
CLBSWOUTH_CLBSWOUT15_MASK                equ 0080h

// Register: CLBSWOUTL
#define CLBSWOUTL CLBSWOUTL
CLBSWOUTL                                equ 0517h
// bitfield definitions
CLBSWOUTL_CLBSWOUTL_POSN                 equ 0000h
CLBSWOUTL_CLBSWOUTL_POSITION             equ 0000h
CLBSWOUTL_CLBSWOUTL_SIZE                 equ 0008h
CLBSWOUTL_CLBSWOUTL_LENGTH               equ 0008h
CLBSWOUTL_CLBSWOUTL_MASK                 equ 00FFh
CLBSWOUTL_CLBSWOUT0_POSN                 equ 0000h
CLBSWOUTL_CLBSWOUT0_POSITION             equ 0000h
CLBSWOUTL_CLBSWOUT0_SIZE                 equ 0001h
CLBSWOUTL_CLBSWOUT0_LENGTH               equ 0001h
CLBSWOUTL_CLBSWOUT0_MASK                 equ 0001h
CLBSWOUTL_CLBSWOUT1_POSN                 equ 0001h
CLBSWOUTL_CLBSWOUT1_POSITION             equ 0001h
CLBSWOUTL_CLBSWOUT1_SIZE                 equ 0001h
CLBSWOUTL_CLBSWOUT1_LENGTH               equ 0001h
CLBSWOUTL_CLBSWOUT1_MASK                 equ 0002h
CLBSWOUTL_CLBSWOUT2_POSN                 equ 0002h
CLBSWOUTL_CLBSWOUT2_POSITION             equ 0002h
CLBSWOUTL_CLBSWOUT2_SIZE                 equ 0001h
CLBSWOUTL_CLBSWOUT2_LENGTH               equ 0001h
CLBSWOUTL_CLBSWOUT2_MASK                 equ 0004h
CLBSWOUTL_CLBSWOUT3_POSN                 equ 0003h
CLBSWOUTL_CLBSWOUT3_POSITION             equ 0003h
CLBSWOUTL_CLBSWOUT3_SIZE                 equ 0001h
CLBSWOUTL_CLBSWOUT3_LENGTH               equ 0001h
CLBSWOUTL_CLBSWOUT3_MASK                 equ 0008h
CLBSWOUTL_CLBSWOUT4_POSN                 equ 0004h
CLBSWOUTL_CLBSWOUT4_POSITION             equ 0004h
CLBSWOUTL_CLBSWOUT4_SIZE                 equ 0001h
CLBSWOUTL_CLBSWOUT4_LENGTH               equ 0001h
CLBSWOUTL_CLBSWOUT4_MASK                 equ 0010h
CLBSWOUTL_CLBSWOUT5_POSN                 equ 0005h
CLBSWOUTL_CLBSWOUT5_POSITION             equ 0005h
CLBSWOUTL_CLBSWOUT5_SIZE                 equ 0001h
CLBSWOUTL_CLBSWOUT5_LENGTH               equ 0001h
CLBSWOUTL_CLBSWOUT5_MASK                 equ 0020h
CLBSWOUTL_CLBSWOUT6_POSN                 equ 0006h
CLBSWOUTL_CLBSWOUT6_POSITION             equ 0006h
CLBSWOUTL_CLBSWOUT6_SIZE                 equ 0001h
CLBSWOUTL_CLBSWOUT6_LENGTH               equ 0001h
CLBSWOUTL_CLBSWOUT6_MASK                 equ 0040h
CLBSWOUTL_CLBSWOUT7_POSN                 equ 0007h
CLBSWOUTL_CLBSWOUT7_POSITION             equ 0007h
CLBSWOUTL_CLBSWOUT7_SIZE                 equ 0001h
CLBSWOUTL_CLBSWOUT7_LENGTH               equ 0001h
CLBSWOUTL_CLBSWOUT7_MASK                 equ 0080h

// Register: CLBDEBUG
#define CLBDEBUG CLBDEBUG
CLBDEBUG                                 equ 0518h
// bitfield definitions
CLBDEBUG_DBG_POSN                        equ 0000h
CLBDEBUG_DBG_POSITION                    equ 0000h
CLBDEBUG_DBG_SIZE                        equ 0008h
CLBDEBUG_DBG_LENGTH                      equ 0008h
CLBDEBUG_DBG_MASK                        equ 00FFh
CLBDEBUG_DBG0_POSN                       equ 0000h
CLBDEBUG_DBG0_POSITION                   equ 0000h
CLBDEBUG_DBG0_SIZE                       equ 0001h
CLBDEBUG_DBG0_LENGTH                     equ 0001h
CLBDEBUG_DBG0_MASK                       equ 0001h
CLBDEBUG_DBG1_POSN                       equ 0001h
CLBDEBUG_DBG1_POSITION                   equ 0001h
CLBDEBUG_DBG1_SIZE                       equ 0001h
CLBDEBUG_DBG1_LENGTH                     equ 0001h
CLBDEBUG_DBG1_MASK                       equ 0002h
CLBDEBUG_DBG2_POSN                       equ 0002h
CLBDEBUG_DBG2_POSITION                   equ 0002h
CLBDEBUG_DBG2_SIZE                       equ 0001h
CLBDEBUG_DBG2_LENGTH                     equ 0001h
CLBDEBUG_DBG2_MASK                       equ 0004h
CLBDEBUG_DBG3_POSN                       equ 0003h
CLBDEBUG_DBG3_POSITION                   equ 0003h
CLBDEBUG_DBG3_SIZE                       equ 0001h
CLBDEBUG_DBG3_LENGTH                     equ 0001h
CLBDEBUG_DBG3_MASK                       equ 0008h
CLBDEBUG_DBG4_POSN                       equ 0004h
CLBDEBUG_DBG4_POSITION                   equ 0004h
CLBDEBUG_DBG4_SIZE                       equ 0001h
CLBDEBUG_DBG4_LENGTH                     equ 0001h
CLBDEBUG_DBG4_MASK                       equ 0010h

// Register: PWM2ERS
#define PWM2ERS PWM2ERS
PWM2ERS                                  equ 058Ch
// bitfield definitions
PWM2ERS_ERS_POSN                         equ 0000h
PWM2ERS_ERS_POSITION                     equ 0000h
PWM2ERS_ERS_SIZE                         equ 0008h
PWM2ERS_ERS_LENGTH                       equ 0008h
PWM2ERS_ERS_MASK                         equ 00FFh
PWM2ERS_ERS0_POSN                        equ 0000h
PWM2ERS_ERS0_POSITION                    equ 0000h
PWM2ERS_ERS0_SIZE                        equ 0001h
PWM2ERS_ERS0_LENGTH                      equ 0001h
PWM2ERS_ERS0_MASK                        equ 0001h
PWM2ERS_ERS1_POSN                        equ 0001h
PWM2ERS_ERS1_POSITION                    equ 0001h
PWM2ERS_ERS1_SIZE                        equ 0001h
PWM2ERS_ERS1_LENGTH                      equ 0001h
PWM2ERS_ERS1_MASK                        equ 0002h
PWM2ERS_ERS2_POSN                        equ 0002h
PWM2ERS_ERS2_POSITION                    equ 0002h
PWM2ERS_ERS2_SIZE                        equ 0001h
PWM2ERS_ERS2_LENGTH                      equ 0001h
PWM2ERS_ERS2_MASK                        equ 0004h
PWM2ERS_ERS3_POSN                        equ 0003h
PWM2ERS_ERS3_POSITION                    equ 0003h
PWM2ERS_ERS3_SIZE                        equ 0001h
PWM2ERS_ERS3_LENGTH                      equ 0001h
PWM2ERS_ERS3_MASK                        equ 0008h

