garyPenhook/PIC-Assembler/device_includes/pic16f13276.inc
#define ANSB2                            BANKMASK(ANSELB), 2
#define ANSB3                            BANKMASK(ANSELB), 3
#define ANSB4                            BANKMASK(ANSELB), 4
#define ANSB5                            BANKMASK(ANSELB), 5
#define ANSB6                            BANKMASK(ANSELB), 6
#define ANSB7                            BANKMASK(ANSELB), 7
#define ANSC0                            BANKMASK(ANSELC), 0
#define ANSC1                            BANKMASK(ANSELC), 1
#define ANSC2                            BANKMASK(ANSELC), 2
#define ANSC3                            BANKMASK(ANSELC), 3
#define ANSC4                            BANKMASK(ANSELC), 4
#define ANSC5                            BANKMASK(ANSELC), 5
#define ANSC6                            BANKMASK(ANSELC), 6
#define ANSC7                            BANKMASK(ANSELC), 7
#define ANSD0                            BANKMASK(ANSELD), 0
#define ANSD1                            BANKMASK(ANSELD), 1
#define ANSD2                            BANKMASK(ANSELD), 2
#define ANSD3                            BANKMASK(ANSELD), 3
#define ANSD4                            BANKMASK(ANSELD), 4
#define ANSD5                            BANKMASK(ANSELD), 5
#define ANSD6                            BANKMASK(ANSELD), 6
#define ANSD7                            BANKMASK(ANSELD), 7
#define ANSE0                            BANKMASK(ANSELE), 0
#define ANSE1                            BANKMASK(ANSELE), 1
#define ANSE2                            BANKMASK(ANSELE), 2
#define ANSEL6                           BANKMASK(ANSELA), 6
#define ANSEL7                           BANKMASK(ANSELA), 7
#define ANSELA0                          BANKMASK(ANSELA), 0
#define ANSELA1                          BANKMASK(ANSELA), 1
#define ANSELA2                          BANKMASK(ANSELA), 2
#define ANSELA3                          BANKMASK(ANSELA), 3
#define ANSELA4                          BANKMASK(ANSELA), 4
#define ANSELA5                          BANKMASK(ANSELA), 5
#define ANSELB0                          BANKMASK(ANSELB), 0
#define ANSELB1                          BANKMASK(ANSELB), 1
#define ANSELB2                          BANKMASK(ANSELB), 2
#define ANSELB3                          BANKMASK(ANSELB), 3
#define ANSELB4                          BANKMASK(ANSELB), 4
#define ANSELB5                          BANKMASK(ANSELB), 5
#define ANSELB6                          BANKMASK(ANSELB), 6
#define ANSELB7                          BANKMASK(ANSELB), 7
#define ANSELC0                          BANKMASK(ANSELC), 0
#define ANSELC1                          BANKMASK(ANSELC), 1
#define ANSELC2                          BANKMASK(ANSELC), 2
#define ANSELC3                          BANKMASK(ANSELC), 3
#define ANSELC4                          BANKMASK(ANSELC), 4
#define ANSELC5                          BANKMASK(ANSELC), 5
#define ANSELC6                          BANKMASK(ANSELC), 6
#define ANSELC7                          BANKMASK(ANSELC), 7
#define ANSELD0                          BANKMASK(ANSELD), 0
#define ANSELD1                          BANKMASK(ANSELD), 1
#define ANSELD2                          BANKMASK(ANSELD), 2
#define ANSELD3                          BANKMASK(ANSELD), 3
#define ANSELD4                          BANKMASK(ANSELD), 4
#define ANSELD5                          BANKMASK(ANSELD), 5
#define ANSELD6                          BANKMASK(ANSELD), 6
#define ANSELD7                          BANKMASK(ANSELD), 7
#define ANSELE0                          BANKMASK(ANSELE), 0
#define ANSELE1                          BANKMASK(ANSELE), 1
#define ANSELE2                          BANKMASK(ANSELE), 2
#define AOV                              BANKMASK(ADSTAT), 7
#define ASYNC                            BANKMASK(T0CON1), 4
#define BCL1IE                           BANKMASK(PIE5), 3
#define BCL1IF                           BANKMASK(PIR5), 3
#define BCL2IE                           BANKMASK(PIE5), 5
#define BCL2IF                           BANKMASK(PIR5), 5
#define BF1                              BANKMASK(SSP1STAT), 0
#define BF2                              BANKMASK(SSP2STAT), 0
#define BORRDY                           BANKMASK(BORCON), 0
#define BSR0                             BANKMASK(BSR), 0
#define BSR1                             BANKMASK(BSR), 1
#define BSR2                             BANKMASK(BSR), 2
#define BSR3                             BANKMASK(BSR), 3
#define BSR4                             BANKMASK(BSR), 4
#define BSR5                             BANKMASK(BSR), 5
#define C1EN                             BANKMASK(CM1CON0), 7
#define C1HYS                            BANKMASK(CM1CON0), 1
#define C1INTN                           BANKMASK(CM1CON1), 0
#define C1INTP                           BANKMASK(CM1CON1), 1
#define C1NCH0                           BANKMASK(CM1NCH), 0
#define C1NCH1                           BANKMASK(CM1NCH), 1
#define C1NCH2                           BANKMASK(CM1NCH), 2
#define C1PCH0                           BANKMASK(CM1PCH), 0
#define C1PCH1                           BANKMASK(CM1PCH), 1
#define C1PCH2                           BANKMASK(CM1PCH), 2
#define C1POL                            BANKMASK(CM1CON0), 4
#define C1SP                             BANKMASK(CM1CON0), 2
#define C1SYNC                           BANKMASK(CM1CON0), 0
#define C2EN                             BANKMASK(CM2CON0), 7
#define C2HYS                            BANKMASK(CM2CON0), 1
#define C2INTN                           BANKMASK(CM2CON1), 0
#define C2INTP                           BANKMASK(CM2CON1), 1
#define C2NCH0                           BANKMASK(CM2NCH), 0
#define C2NCH1                           BANKMASK(CM2NCH), 1
#define C2NCH2                           BANKMASK(CM2NCH), 2
#define C2PCH0                           BANKMASK(CM2PCH), 0
#define C2PCH1                           BANKMASK(CM2PCH), 1
#define C2PCH2                           BANKMASK(CM2PCH), 2
#define C2POL                            BANKMASK(CM2CON0), 4
#define C2SP                             BANKMASK(CM2CON0), 2
#define C2SYNC                           BANKMASK(CM2CON0), 0
#define CAL01                            BANKMASK(TMR1L), 0
#define CAL03                            BANKMASK(TMR3L), 0
#define CAL11                            BANKMASK(TMR1L), 1
#define CAL13                            BANKMASK(TMR3L), 1
#define CAL21                            BANKMASK(TMR1L), 2
#define CAL23                            BANKMASK(TMR3L), 2
#define CAL31                            BANKMASK(TMR1L), 3
#define CAL33                            BANKMASK(TMR3L), 3
#define CAL41                            BANKMASK(TMR1L), 4
#define CAL43                            BANKMASK(TMR3L), 4
#define CAL51                            BANKMASK(TMR1L), 5
#define CAL53                            BANKMASK(TMR3L), 5
#define CAL61                            BANKMASK(TMR1L), 6
#define CAL63                            BANKMASK(TMR3L), 6
#define CAL71                            BANKMASK(TMR1L), 7
#define CAL73                            BANKMASK(TMR3L), 7
#define CALC0                            BANKMASK(ADCON3), 4
#define CALC1                            BANKMASK(ADCON3), 5
#define CALC2                            BANKMASK(ADCON3), 6
#define CARRY                            BANKMASK(STATUS), 0
#define CCP1CTS0                         BANKMASK(CCP1CAP), 0
#define CCP1CTS1                         BANKMASK(CCP1CAP), 1
#define CCP1CTS2                         BANKMASK(CCP1CAP), 2
#define CCP1CTS3                         BANKMASK(CCP1CAP), 3
#define CCP1EN                           BANKMASK(CCP1CON), 7
#define CCP1FMT                          BANKMASK(CCP1CON), 4
#define CCP1IE                           BANKMASK(PIE2), 5
#define CCP1IF                           BANKMASK(PIR2), 5
#define CCP1MD                           BANKMASK(PMD1), 5
#define CCP1MODE0                        BANKMASK(CCP1CON), 0
#define CCP1MODE1                        BANKMASK(CCP1CON), 1
#define CCP1MODE2                        BANKMASK(CCP1CON), 2
#define CCP1MODE3                        BANKMASK(CCP1CON), 3
#define CCP1OUT                          BANKMASK(CCP1CON), 5
#define CCP2CTS0                         BANKMASK(CCP2CAP), 0
#define CCP2CTS1                         BANKMASK(CCP2CAP), 1
#define CCP2CTS2                         BANKMASK(CCP2CAP), 2
#define CCP2CTS3                         BANKMASK(CCP2CAP), 3
#define CCP2EN                           BANKMASK(CCP2CON), 7
#define CCP2FMT                          BANKMASK(CCP2CON), 4
#define CCP2IE                           BANKMASK(PIE2), 6
#define CCP2IF                           BANKMASK(PIR2), 6
#define CCP2MD                           BANKMASK(PMD1), 6
#define CCP2MODE0                        BANKMASK(CCP2CON), 0
#define CCP2MODE1                        BANKMASK(CCP2CON), 1
#define CCP2MODE2                        BANKMASK(CCP2CON), 2
#define CCP2MODE3                        BANKMASK(CCP2CON), 3
#define CCP2OUT                          BANKMASK(CCP2CON), 5
#define CDAFVR0                          BANKMASK(FVRCON), 2
#define CDAFVR1                          BANKMASK(FVRCON), 3
#define CDIV0                            BANKMASK(OSCCON2), 0
#define CDIV1                            BANKMASK(OSCCON2), 1
#define CDIV2                            BANKMASK(OSCCON2), 2
#define CDIV3                            BANKMASK(OSCCON2), 3
#define CGA0                             BANKMASK(ADCG1A), 0
#define CGA1                             BANKMASK(ADCG1A), 1
#define CGA2                             BANKMASK(ADCG1A), 2
#define CGA3                             BANKMASK(ADCG1A), 3
#define CGA4                             BANKMASK(ADCG1A), 4
#define CGA5                             BANKMASK(ADCG1A), 5
#define CGA6                             BANKMASK(ADCG1A), 6
#define CGA7                             BANKMASK(ADCG1A), 7
#define CGB0                             BANKMASK(ADCG1B), 0
#define CGB1                             BANKMASK(ADCG1B), 1
#define CGB2                             BANKMASK(ADCG1B), 2
#define CGB3                             BANKMASK(ADCG1B), 3
#define CGB4                             BANKMASK(ADCG1B), 4
#define CGB5                             BANKMASK(ADCG1B), 5
#define CGB6                             BANKMASK(ADCG1B), 6
#define CGB7                             BANKMASK(ADCG1B), 7
#define CGC0                             BANKMASK(ADCG1C), 0
#define CGC1                             BANKMASK(ADCG1C), 1
#define CGC2                             BANKMASK(ADCG1C), 2
#define CGC3                             BANKMASK(ADCG1C), 3
#define CGC4                             BANKMASK(ADCG1C), 4
#define CGC5                             BANKMASK(ADCG1C), 5
#define CGC6                             BANKMASK(ADCG1C), 6
#define CGC7                             BANKMASK(ADCG1C), 7
#define CGD0                             BANKMASK(ADCG1D), 0
#define CGD1                             BANKMASK(ADCG1D), 1
#define CGD2                             BANKMASK(ADCG1D), 2
#define CGD3                             BANKMASK(ADCG1D), 3
#define CGD4                             BANKMASK(ADCG1D), 4
#define CGD5                             BANKMASK(ADCG1D), 5
#define CGD6                             BANKMASK(ADCG1D), 6
#define CGD7                             BANKMASK(ADCG1D), 7
#define CGE0                             BANKMASK(ADCG1E), 0
#define CGE1                             BANKMASK(ADCG1E), 1
#define CGE2                             BANKMASK(ADCG1E), 2
#define CKE1                             BANKMASK(SSP1STAT), 6
#define CKE2                             BANKMASK(SSP2STAT), 6
#define CKP1                             BANKMASK(SSP1CON1), 4
#define CKP2                             BANKMASK(SSP2CON1), 4
#define CKPS3                            BANKMASK(T0CON1), 3
#define CLB1IE0                          BANKMASK(PIE7), 0
#define CLB1IE1                          BANKMASK(PIE7), 1
#define CLB1IE2                          BANKMASK(PIE7), 2
#define CLB1IE3                          BANKMASK(PIE7), 3
#define CLB1IF0                          BANKMASK(PIR7), 0
#define CLB1IF1                          BANKMASK(PIR7), 1
#define CLB1IF2                          BANKMASK(PIR7), 2
#define CLB1IF3                          BANKMASK(PIR7), 3
#define CLBEN                            BANKMASK(CLBCON), 7
#define CLBMD                            BANKMASK(PMD4), 7
#define CLBSWIN0                         BANKMASK(CLBSWINL), 0
#define CLBSWIN1                         BANKMASK(CLBSWINL), 1
#define CLBSWIN10                        BANKMASK(CLBSWINM), 2
#define CLBSWIN11                        BANKMASK(CLBSWINM), 3
#define CLBSWIN12                        BANKMASK(CLBSWINM), 4
#define CLBSWIN13                        BANKMASK(CLBSWINM), 5
#define CLBSWIN14                        BANKMASK(CLBSWINM), 6
#define CLBSWIN15                        BANKMASK(CLBSWINM), 7
#define CLBSWIN16                        BANKMASK(CLBSWINH), 0
#define CLBSWIN17                        BANKMASK(CLBSWINH), 1
#define CLBSWIN18                        BANKMASK(CLBSWINH), 2
#define CLBSWIN19                        BANKMASK(CLBSWINH), 3
#define CLBSWIN2                         BANKMASK(CLBSWINL), 2
#define CLBSWIN20                        BANKMASK(CLBSWINH), 4
#define CLBSWIN21                        BANKMASK(CLBSWINH), 5
#define CLBSWIN22                        BANKMASK(CLBSWINH), 6
#define CLBSWIN23                        BANKMASK(CLBSWINH), 7
#define CLBSWIN24                        BANKMASK(CLBSWINU), 0
#define CLBSWIN25                        BANKMASK(CLBSWINU), 1
#define CLBSWIN26                        BANKMASK(CLBSWINU), 2
#define CLBSWIN27                        BANKMASK(CLBSWINU), 3
#define CLBSWIN28                        BANKMASK(CLBSWINU), 4
#define CLBSWIN29                        BANKMASK(CLBSWINU), 5
#define CLBSWIN3                         BANKMASK(CLBSWINL), 3
#define CLBSWIN30                        BANKMASK(CLBSWINU), 6
#define CLBSWIN31                        BANKMASK(CLBSWINU), 7
#define CLBSWIN4                         BANKMASK(CLBSWINL), 4
#define CLBSWIN5                         BANKMASK(CLBSWINL), 5
#define CLBSWIN6                         BANKMASK(CLBSWINL), 6
#define CLBSWIN7                         BANKMASK(CLBSWINL), 7
#define CLBSWIN8                         BANKMASK(CLBSWINM), 0
#define CLBSWIN9                         BANKMASK(CLBSWINM), 1
#define CLBSWOUT0                        BANKMASK(CLBSWOUTL), 0
#define CLBSWOUT1                        BANKMASK(CLBSWOUTL), 1
#define CLBSWOUT10                       BANKMASK(CLBSWOUTH), 2
#define CLBSWOUT11                       BANKMASK(CLBSWOUTH), 3
#define CLBSWOUT12                       BANKMASK(CLBSWOUTH), 4
#define CLBSWOUT13                       BANKMASK(CLBSWOUTH), 5
#define CLBSWOUT14                       BANKMASK(CLBSWOUTH), 6
#define CLBSWOUT15                       BANKMASK(CLBSWOUTH), 7
#define CLBSWOUT2                        BANKMASK(CLBSWOUTL), 2
#define CLBSWOUT3                        BANKMASK(CLBSWOUTL), 3
#define CLBSWOUT4                        BANKMASK(CLBSWOUTL), 4
#define CLBSWOUT5                        BANKMASK(CLBSWOUTL), 5
#define CLBSWOUT6                        BANKMASK(CLBSWOUTL), 6
#define CLBSWOUT7                        BANKMASK(CLBSWOUTL), 7
#define CLBSWOUT8                        BANKMASK(CLBSWOUTH), 0
#define CLBSWOUT9                        BANKMASK(CLBSWOUTH), 1
#define CLC1IE                           BANKMASK(PIE4), 2
#define CLC1IF                           BANKMASK(PIR4), 2
#define CLC1MD                           BANKMASK(PMD2), 5
#define CLC1OUT                          BANKMASK(CLCDATA), 0
#define CLC2IE                           BANKMASK(PIE4), 3
#define CLC2IF                           BANKMASK(PIR4), 3
#define CLC2MD                           BANKMASK(PMD2), 6
#define CLC2OUT                          BANKMASK(CLCDATA), 1
#define CLC3IE                           BANKMASK(PIE4), 4
#define CLC3IF                           BANKMASK(PIR4), 4
#define CLC3MD                           BANKMASK(PMD2), 7
#define CLC3OUT                          BANKMASK(CLCDATA), 2
#define CLC4IE                           BANKMASK(PIE4), 5
#define CLC4IF                           BANKMASK(PIR4), 5
#define CLC4MD                           BANKMASK(PMD3), 0
#define CLC4OUT                          BANKMASK(CLCDATA), 3
#define CLK4                             BANKMASK(CLBCLK), 4
#define CLK5                             BANKMASK(CLBCLK), 5
#define CLK6                             BANKMASK(CLBCLK), 6
#define CLK7                             BANKMASK(CLBCLK), 7
#define CLKRMD                           BANKMASK(PMD0), 6
#define CM1IE                            BANKMASK(PIE5), 6
#define CM1IF                            BANKMASK(PIR5), 6
#define CM1MD                            BANKMASK(PMD3), 6
#define CM2IE                            BANKMASK(PIE5), 7
#define CM2IF                            BANKMASK(PIR5), 7
#define CM2MD                            BANKMASK(PMD3), 7
#define CNT0                             BANKMASK(ADCNT), 0
#define CNT1                             BANKMASK(ADCNT), 1
#define CNT2                             BANKMASK(ADCNT), 2
#define CNT3                             BANKMASK(ADCNT), 3
#define CNT4                             BANKMASK(ADCNT), 4
#define CNT5                             BANKMASK(ADCNT), 5
#define CNT6                             BANKMASK(ADCNT), 6
#define CNT7                             BANKMASK(ADCNT), 7
#define CONT                             BANKMASK(ADCON0), 6
#define COSC0                            BANKMASK(OSCCON2), 4
#define COSC1                            BANKMASK(OSCCON2), 5
#define COSC2                            BANKMASK(OSCCON2), 6
#define CPOS                             BANKMASK(CPCON), 5
#define CPRDY                            BANKMASK(CPCON), 0
#define CPREQ                            BANKMASK(CPCON), 2
#define CPT                              BANKMASK(CPCON), 1
#define CRCBUSY                          BANKMASK(CRCCON0), 5
#define CRCEN                            BANKMASK(CRCCON0), 7
#define CRCGO                            BANKMASK(CRCCON0), 6
#define CRCIE                            BANKMASK(PIE1), 1
#define CRCIF                            BANKMASK(PIR1), 1
#define CRCMD                            BANKMASK(PMD0), 1
#define CRS0                             BANKMASK(ADCON2), 4
#define CRS1                             BANKMASK(ADCON2), 5
#define CRS2                             BANKMASK(ADCON2), 6
#define CS                               BANKMASK(ADCON0), 4
#define CS5                              BANKMASK(ADCLK), 5
#define CSWHOLD                          BANKMASK(OSCCON3), 7
#define CSWIE                            BANKMASK(PIE1), 4
#define CSWIF                            BANKMASK(PIR1), 4
#define D1S0                             BANKMASK(CLCnSEL0), 0
#define D1S1                             BANKMASK(CLCnSEL0), 1
#define D1S2                             BANKMASK(CLCnSEL0), 2
#define D1S3                             BANKMASK(CLCnSEL0), 3
#define D1S4                             BANKMASK(CLCnSEL0), 4
#define D1S5                             BANKMASK(CLCnSEL0), 5
#define D1S6                             BANKMASK(CLCnSEL0), 6
#define D2S0                             BANKMASK(CLCnSEL1), 0
#define D2S1                             BANKMASK(CLCnSEL1), 1
#define D2S2                             BANKMASK(CLCnSEL1), 2
#define D2S3                             BANKMASK(CLCnSEL1), 3
#define D2S4                             BANKMASK(CLCnSEL1), 4
#define D2S5                             BANKMASK(CLCnSEL1), 5
#define D2S6                             BANKMASK(CLCnSEL1), 6
#define D3S0                             BANKMASK(CLCnSEL2), 0
#define D3S1                             BANKMASK(CLCnSEL2), 1
#define D3S2                             BANKMASK(CLCnSEL2), 2
#define D3S3                             BANKMASK(CLCnSEL2), 3
#define D3S4                             BANKMASK(CLCnSEL2), 4
#define D3S5                             BANKMASK(CLCnSEL2), 5
#define D3S6                             BANKMASK(CLCnSEL2), 6
#define D4S0                             BANKMASK(CLCnSEL3), 0
#define D4S1                             BANKMASK(CLCnSEL3), 1
#define D4S2                             BANKMASK(CLCnSEL3), 2
#define D4S3                             BANKMASK(CLCnSEL3), 3
#define D4S4                             BANKMASK(CLCnSEL3), 4
#define D4S5                             BANKMASK(CLCnSEL3), 5
#define D4S6                             BANKMASK(CLCnSEL3), 6
#define DA1                              BANKMASK(SSP1STAT), 5
#define DA2                              BANKMASK(SSP2STAT), 5
#define DABORT                           BANKMASK(SCANCON0), 4
#define DAC1MD                           BANKMASK(PMD4), 1
#define DATA0                            BANKMASK(CRCDATAL), 0
#define DATA1                            BANKMASK(CRCDATAL), 1
#define DATA10                           BANKMASK(CRCDATAH), 2
#define DATA11                           BANKMASK(CRCDATAH), 3
#define DATA12                           BANKMASK(CRCDATAH), 4
#define DATA13                           BANKMASK(CRCDATAH), 5
#define DATA14                           BANKMASK(CRCDATAH), 6
#define DATA15                           BANKMASK(CRCDATAH), 7
#define DATA16                           BANKMASK(CRCDATAU), 0
#define DATA17                           BANKMASK(CRCDATAU), 1
#define DATA18                           BANKMASK(CRCDATAU), 2
#define DATA19                           BANKMASK(CRCDATAU), 3
#define DATA2                            BANKMASK(CRCDATAL), 2
#define DATA20                           BANKMASK(CRCDATAU), 4
#define DATA21                           BANKMASK(CRCDATAU), 5
#define DATA22                           BANKMASK(CRCDATAU), 6
#define DATA23                           BANKMASK(CRCDATAU), 7
#define DATA24                           BANKMASK(CRCDATAT), 0
#define DATA25                           BANKMASK(CRCDATAT), 1
#define DATA26                           BANKMASK(CRCDATAT), 2
#define DATA27                           BANKMASK(CRCDATAT), 3
#define DATA28                           BANKMASK(CRCDATAT), 4
#define DATA29                           BANKMASK(CRCDATAT), 5
#define DATA3                            BANKMASK(CRCDATAL), 3
#define DATA30                           BANKMASK(CRCDATAT), 6
#define DATA31                           BANKMASK(CRCDATAT), 7
#define DATA4                            BANKMASK(CRCDATAL), 4
#define DATA5                            BANKMASK(CRCDATAL), 5
#define DATA6                            BANKMASK(CRCDATAL), 6
#define DATA7                            BANKMASK(CRCDATAL), 7
#define DATA8                            BANKMASK(CRCDATAH), 0
#define DATA9                            BANKMASK(CRCDATAH), 1
#define DATA_ADDRESS1                    BANKMASK(SSP1STAT), 5
#define DATA_ADDRESS2                    BANKMASK(SSP2STAT), 5
#define DB0STAT                          BANKMASK(CLBCON), 2
#define DBG0                             BANKMASK(CLBDEBUG), 0
#define DBG1                             BANKMASK(CLBDEBUG), 1
#define DBG2                             BANKMASK(CLBDEBUG), 2
#define DBG3                             BANKMASK(CLBDEBUG), 3
#define DBG4                             BANKMASK(CLBDEBUG), 4
#define DC                               BANKMASK(STATUS), 1
#define DC0                              BANKMASK(CLKRCON), 3
#define DC1                              BANKMASK(CLKRCON), 4
#define DIV0                             BANKMASK(CLKRCON), 0
#define DIV1                             BANKMASK(CLKRCON), 1
#define DIV2                             BANKMASK(CLKRCON), 2
#define DLEN0                            BANKMASK(CRCCON2), 0
#define DLEN1                            BANKMASK(CRCCON2), 1
